/* Задача 17. Пренапишете задачи 14 и 15 от лекция 22 за Потребителски
типове като пуснете двете екзета в pipe:
maraton.exe | sort.exe
Задача 14 Напишете програма, в която се въвеждат пореден
номер, име, фамилия, възраст на участници в маратон.
Изискването е, за името и фамилията, да не се използват масиви
с фиксирана дължина. След като въвеждането завърши,
изведете списък с участниците.
Задача 15 Използвайки предишното упражнение, изведете
участниците подредени по азбучен ред.*/

/*
./20210226_14.exe | ./20210226_15.exe
3
67 Asen Dimitrov 15
123 Nedyalko Zhelyazkov 17
1 Gina Stoycheva 89
|67 | Asen | Dimitrov | 15 |
|1 | Gina | Stoycheva | 89 |
|123 | Nedyalko | Zhelyazkov | 17 | 
*/
