/*Задача 11. Напишете програма, която умножава 2 числа, като използва пойнтер-и. 
Пойнтер-ите не са страшни. Дефинират се като тип *Х и се използват като *Х. Както променливите, но със * отпред (и 1 наум!).
Продължение: Опитайте да умножите 2 променливи от различен тип, използвайки пойнтери.*/
#include <stdio.h>

int main(void)
{
    int a = 10, b = 5;
    int *pa = &a;
    int *pb = &b;
    printf("Multiplication of a=%d and b=%d is=%i\n", a, b, *pa * *pb);
    return 0;
}