/*Задача 7.Направете програма, в която инициализирате пойнтер към
променлива и след това изчислявате сбор на променливата
(използвайки пойнтера) + 5. Отпечатайте на*/
#include <stdio.h>

int main()
{
    int a = 2;
    int *pa = &a;
    *pa = *pa + 5;
    printf("address of *pi is %p, pointer = %d \n", &pa, *pa);
    return 0;
}