/*Задача 6.Дефинирайте променлива „а“, дeфинирайте пойнтер към
нея, присвоете му адреса на променливата. През пойнтера
задайте нова стойност = 5 на променливата „а“. Каква е
стойността на “а”?.*/
#include <stdio.h>

int main()
{
    int a = 0;
    int *pa = &a;
    *pa = 5;
    printf("address of *pi is %p, pointer = %d \n", &pa, *pa);
    return 0;
}