/*Първата функция strcpy(s, t), която копира низа t в низа s. Щеше да е
чудесно просто да кажем s = t, но по този начин ще копираме указателите, а
не всички символи от единия в другия масив. За да стане това трябва да
обходим целия масив символ по символ и като използваме цикъл и да
присвоим стойността всеки един елемент от единия масив на същата
позиция в другия.
Задача 3.Опитайте да го направите сами: */
#include <stdio.h>

void Mystrcpy(char *t, char *s){
    while(*t++ = *s++);
    printf("%s",s);
}

int main(void) {
    char t[] = "ABCDEFG";
    char s[] = "ZZZZZZZ";
    
    printf("Array t = %s after using strcpy array is = ", t);
    Mystrcpy(t,s);
    printf("\n");
    return 0;
}