/*
 ============================================================================
 Name        : BusinessCardManager.c
 Author      : Martina Vincheva
 Version     :
 Copyright   : Your copyright notice
 Description : Задача за визитник
                Направете програма за съхранение и сортиране на визитки в електронен вид. 
                За всяка визитка се въвеждат: име, презиме, фамилия, домашен тел., служебен тел., email, фирма, адреса на фирма.
                Броя на въведените визитки не трябва да се ограничава.
                Необходимо е да се осигури извеждане на визитките сортирани или по име, или по фамилия, или по фирма.
                Да се даде възможност на потребителя да търси по име, фамилия и/или фирма.
                Да се осигури експорт и импорт към/от CSV файлове (comma-separated values)
 ============================================================================
*/

#include <stdio.h>
#include "cardManager.h"

int main()
{
    fflush(stdin);
    cardManager();
    return 0;
}
