/*Задача 4.Напишете функцията int binarySearch(int a[], int n, int
x), която получава като първи аргумент началото на масив а,
втория аргумент е дължината на масива, а третия аргумент е
числото, което търсим. Знаем, че масива в който ще търсим
елемента е предварително подреден. Сравняваме тъсения
елемент с елемента в средата на масива. Ако той е по голям от
този в средата търсим елемента от средата до края, ако е по
малък го търсим в частта от началото до средата. Това се
повтаря, докато елемента от масива не стане равен с търсения.
Тогава връщаме номера на който се намира елемента в масива
или 1 ако не се съдържа в масива. */
#include <stdio.h>

int binarySearch(int a[], int n, int x){
    int beg = 0, end = n;

    while(beg < end){
        int mid = beg + (end - beg)/2;

        if(a[mid] < x)
            beg = mid + 1;
        else
            end = mid;
    }

    return end;  
}
int main(void) {
    int a[] = {10,15,20,25,30,35,40,45};
    int n = 9,x = 15, element;

    element = binarySearch(a,n,x);   
    printf("This element is present on position: %d", element);

    return 0;
}
