/*Задача 9. Използвайте do - while цикъл, за да напишете функцията
void itoa(int n, char s[ ]), която преобразува число в символен низ (обратната функция на atoi).
do - while цикълът e необходим, тъй като в масива s[ ] ще трябва да се постави поне един символ, дори ако n е нула.
Ако n = 123, за да вземем последната цифра, трябва да разделим n по модул(%) на основата на бройната система 10.
За да получите чаръктър число, трябва да съберете резултата с '0' т.е. 48.
За да вземете следващото число, трябва да разделите n на 10.
Това продължава докато n е различно от нула.
Това генерира низа в обратен ред 321, затова използваме функцията reverse(char s[]); от задача 8 , за да обърнем низа.*/
#include <stdio.h>
#include <string.h>

void reverse(char s[]) {
    int i, j;
    char c;
    
    for(i = 0, j = strlen(s) - 1; i < j; i++, j--) {
        c = s[j];
        s[j] = s[i];
        s[i] = c;
    }
}

void itoa(int n, char s[]) {
    char *p = s;

    do
    {
        *p++ = n % 10 + '0';
        n = n / 10;
    } while (n != 0);
    *p = '\0';
    reverse(s);
}

int main(void) {
    int number = 12345678;
    char str[10] = {0};

    itoa(number,  str);
    printf("Int number %d in a string is  %s\n", number, str);
    return 0;
}