/*Упражнение 1 8 * Направете бягаща светлина , като приемете , че всеки бит
от дадена променлива , е свързан с лампа или светодиод ). Когато битът е
нула , лампата не свети , когато е единица свети .
Примерно
, ако генерирате последователност :
1, 2, 3, 4,
се получава следното :
1 *....................
2 .*...................
4 ..*..................
8 ...*................. ...
За
да генерирате закъснение , използвайте следната функция от C runtime:
#include <
unistd.h
unsigned int sleep(unsigned int seconds); */
#include <stdio.h>
#include <unistd.h>

void bin(unsigned n) {
    unsigned i;
    for (i = 1 << 7; i > 0; i = i >> 1 )
        (n & i)? printf("*"): printf(".");
        printf("\n");
    }
int main(){
    int a=1;
    for (int i = 0; i < 8; i++){
        int c= a<<i;
        bin(c);
        sleep(2);
    }
}
