/*Задача10. Да намерим простите числа до 1000 и да ги сложим в масив.
Да напишем функция, която да ни казва дали дадено число от 0 до 1000 е просто.
Просто число е се нарича всяко естествено число , по-голямо от 1 ,
което има точно два естествени делителя - 1 и самото себе си.
Например 5 е просто, защото се дели единствено на 1 и 5, докато 6 не
е, защото се дели освен на 1 и 6, и на 2 и 3. */
#include <stdio.h>

int main()
{
    int primes[1000];
    int i, j;

    primes[0] = 0;
    primes[1] = 1;
    for (int i = 0; i <= 1000; i++)
    {
        if (primes[i] == 1)
        {
            for (j = 2; i * j <= 1000; j++)
            {
                primes[i * j] = 0;
            }
        }
    }



    return 0;
}